{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"trainable": true, "unit_forget_bias": true, "use_bias": true, "recurrent_constraint": null, "dropout": 0.5, "units": 512, "kernel_constraint": null, "go_backwards": false, "stateful": false, "dtype": "float32", "recurrent_dropout": 0.0, "activation": "tanh", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "name": "lstm_1", "return_state": false, "recurrent_regularizer": null, "unroll": false, "activity_regularizer": null, "batch_input_shape": [null, null, 25088], "return_sequences": false, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "implementation": 1, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "Dense", "config": {"trainable": true, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "units": 512, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "seed": null, "noise_shape": null, "rate": 0.5}}, {"class_name": "Dense", "config": {"trainable": true, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "units": 4, "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "bias_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "softmax"}}], "backend": "tensorflow", "keras_version": "2.1.2"}