{"config": [{"config": {"name": "bidirectional_1", "layer": {"config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "stateful": false, "go_backwards": false, "bias_regularizer": null, "unit_forget_bias": true, "unroll": false, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "return_state": false, "units": 512, "implementation": 1, "name": "lstm_1", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null, "dropout": 0.0, "use_bias": true, "recurrent_dropout": 0.0, "return_sequences": true, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "recurrent_constraint": null}, "class_name": "LSTM"}, "merge_mode": "concat", "dtype": "float32", "trainable": true, "batch_input_shape": [null, 2, 1000]}, "class_name": "Bidirectional"}, {"config": {"trainable": true, "name": "bidirectional_2", "layer": {"config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "stateful": false, "go_backwards": false, "bias_regularizer": null, "unit_forget_bias": true, "unroll": false, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "return_state": false, "units": 10, "implementation": 1, "name": "lstm_2", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null, "dropout": 0.0, "use_bias": true, "recurrent_dropout": 0.0, "return_sequences": false, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "recurrent_constraint": null}, "class_name": "LSTM"}, "merge_mode": "concat"}, "class_name": "Bidirectional"}, {"config": {"activity_regularizer": null, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "units": 2048}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "units": 1024}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_1", "seed": null, "noise_shape": null, "rate": 0.6}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "name": "dense_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "units": 2}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "2.1.2", "backend": "tensorflow"}