{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.2", "config": [{"class_name": "LSTM", "config": {"unroll": false, "kernel_regularizer": null, "recurrent_regularizer": null, "unit_forget_bias": true, "return_sequences": false, "kernel_constraint": null, "name": "lstm_1", "units": 1024, "return_state": false, "recurrent_dropout": 0.0, "go_backwards": false, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "recurrent_constraint": null, "stateful": false, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "bias_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "implementation": 1, "trainable": true, "dtype": "float32", "use_bias": true, "batch_input_shape": [null, null, 1000], "dropout": 0.5}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "units": 512, "name": "dense_1", "activation": "relu", "kernel_constraint": null, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.5, "seed": null, "trainable": true, "noise_shape": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "units": 2, "name": "dense_2", "activation": "linear", "kernel_constraint": null, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "softmax"}}]}