{"config": [{"config": {"merge_mode": "concat", "dtype": "float32", "name": "bidirectional_1", "batch_input_shape": [null, 2, 25088], "layer": {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "bias_regularizer": null, "recurrent_constraint": null, "recurrent_dropout": 0.0, "activity_regularizer": null, "activation": "tanh", "implementation": 1, "return_state": false, "recurrent_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "units": 512, "kernel_regularizer": null, "trainable": true, "stateful": false, "return_sequences": true, "dropout": 0.0, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "name": "lstm_1", "unit_forget_bias": true, "use_bias": true, "unroll": false}, "class_name": "LSTM"}, "trainable": true}, "class_name": "Bidirectional"}, {"config": {"name": "bidirectional_2", "layer": {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "bias_regularizer": null, "recurrent_constraint": null, "recurrent_dropout": 0.0, "activity_regularizer": null, "activation": "tanh", "implementation": 1, "return_state": false, "recurrent_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "units": 10, "kernel_regularizer": null, "trainable": true, "stateful": false, "return_sequences": false, "dropout": 0.0, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "name": "lstm_2", "unit_forget_bias": true, "use_bias": true, "unroll": false}, "class_name": "LSTM"}, "trainable": true, "merge_mode": "concat"}, "class_name": "Bidirectional"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "units": 512, "bias_regularizer": null, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "activation": "relu", "name": "dense_1", "use_bias": true}, "class_name": "Dense"}, {"config": {"seed": null, "rate": 0.5, "name": "dropout_1", "noise_shape": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "units": 2, "bias_regularizer": null, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "activation": "linear", "name": "dense_2", "use_bias": true}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "keras_version": "2.1.2", "class_name": "Sequential", "backend": "tensorflow"}