{"config": [{"config": {"trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "recurrent_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unroll": false, "dtype": "float32", "name": "lstm_1", "kernel_regularizer": null, "unit_forget_bias": true, "stateful": false, "units": 512, "go_backwards": false, "batch_input_shape": [null, null, 1000], "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "bias_constraint": null, "bias_regularizer": null, "implementation": 1, "return_sequences": false, "recurrent_regularizer": null, "use_bias": true, "return_state": false, "dropout": 0.5, "recurrent_dropout": 0.0, "kernel_constraint": null}, "class_name": "LSTM"}, {"config": {"trainable": true, "units": 512, "activation": "relu", "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "dense_1", "kernel_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"rate": 0.5, "trainable": true, "noise_shape": null, "seed": null, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "units": 4, "activation": "linear", "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "dense_2", "kernel_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "softmax", "name": "activation_1"}, "class_name": "Activation"}], "keras_version": "2.1.2", "class_name": "Sequential", "backend": "tensorflow"}