{"class_name": "Sequential", "keras_version": "2.1.2", "backend": "tensorflow", "config": [{"class_name": "Bidirectional", "config": {"dtype": "float32", "batch_input_shape": [null, 30, 25088], "merge_mode": "concat", "trainable": true, "layer": {"class_name": "LSTM", "config": {"return_sequences": true, "unroll": false, "recurrent_regularizer": null, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "return_state": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "go_backwards": false, "units": 512, "activation": "tanh", "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "recurrent_constraint": null, "name": "lstm_1", "implementation": 1, "dropout": 0.0, "stateful": false, "trainable": true, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_regularizer": null}}, "name": "bidirectional_1"}}, {"class_name": "Bidirectional", "config": {"merge_mode": "concat", "trainable": true, "layer": {"class_name": "LSTM", "config": {"return_sequences": false, "unroll": false, "recurrent_regularizer": null, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "return_state": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "go_backwards": false, "units": 10, "activation": "tanh", "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "recurrent_constraint": null, "name": "lstm_2", "implementation": 1, "dropout": 0.0, "stateful": false, "trainable": true, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_regularizer": null}}, "name": "bidirectional_2"}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_constraint": null, "activation": "relu", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "units": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "name": "dense_1", "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.5, "trainable": true, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "units": 4, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "name": "dense_2", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "softmax", "name": "activation_1"}}]}