{"backend": "tensorflow", "keras_version": "2.1.2", "config": [{"config": {"batch_input_shape": [null, 30, 1000], "layer": {"config": {"kernel_constraint": null, "unit_forget_bias": true, "trainable": true, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_regularizer": null, "activation": "tanh", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "unroll": false, "return_sequences": true, "stateful": false, "activity_regularizer": null, "recurrent_regularizer": null, "name": "lstm_1", "implementation": 1, "go_backwards": false, "units": 512, "bias_constraint": null, "recurrent_constraint": null, "kernel_regularizer": null, "recurrent_dropout": 0.0, "dropout": 0.0, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "return_state": false}, "class_name": "LSTM"}, "dtype": "float32", "trainable": true, "name": "bidirectional_1", "merge_mode": "concat"}, "class_name": "Bidirectional"}, {"config": {"trainable": true, "name": "bidirectional_2", "merge_mode": "concat", "layer": {"config": {"kernel_constraint": null, "unit_forget_bias": true, "trainable": true, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_regularizer": null, "activation": "tanh", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "unroll": false, "return_sequences": false, "stateful": false, "activity_regularizer": null, "recurrent_regularizer": null, "name": "lstm_2", "implementation": 1, "go_backwards": false, "units": 10, "bias_constraint": null, "recurrent_constraint": null, "kernel_regularizer": null, "recurrent_dropout": 0.0, "dropout": 0.0, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "return_state": false}, "class_name": "LSTM"}}, "class_name": "Bidirectional"}, {"config": {"activity_regularizer": null, "units": 512, "trainable": true, "name": "dense_1", "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_regularizer": null, "activation": "relu", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_1", "seed": null, "rate": 0.5, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "units": 4, "trainable": true, "name": "dense_2", "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_regularizer": null, "activation": "linear", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential"}